KanatERPSukhova.КанатАдаптация/src/DataProcessors/КАНАТ_ОтчетыРезультатИспытаний/КАНАТ_ОтчетыРезультатИспытаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КАНАТ_ОтчетыРезультатИспытаний</name>
</mdclass:DataProcessor>

KanatERPSukhova.КанатАдаптация/src/InformationRegisters/КАНАТКач_СоответствиеПоказателейНТДКолонкамОтчетов/КАНАТКач_СоответствиеПоказателейНТДКолонкамОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КАНАТКач_СоответствиеПоказателейНТДКолонкамОтчетов</name>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.КАНАТ_НТДПоказатели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДляОтчета</name>
    <type>
      <types>EnumRef.КАНАТКач_ВидКачестваДляОтчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПараметрОтчетов</name>
    <type>
      <types>EnumRef.КАНАТКач_ПараметрыОтчетов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

KanatERPSukhova.КанатАдаптация/src/Enums/КАНАТКач_ПараметрыОтчетов/КАНАТКач_ПараметрыОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КАНАТКач_ПараметрыОтчетов</name>
  <enumValues>
    <name>ВиткиНа1м</name>
  </enumValues>
  <enumValues>
    <name>ВысотаПлетения</name>
  </enumValues>
  <enumValues>
    <name>Диаметр</name>
  </enumValues>
  <enumValues>
    <name>ДлинаКаната</name>
  </enumValues>
  <enumValues>
    <name>ДлинаПетли</name>
  </enumValues>
  <enumValues>
    <name>КВПоРазрывнойНагрузке</name>
  </enumValues>
  <enumValues>
    <name>КВПоШагуЯчеи</name>
  </enumValues>
  <enumValues>
    <name>КоличествоРывковДоРазрыва1</name>
  </enumValues>
  <enumValues>
    <name>КоличествоРывковДоРазрыва177</name>
  </enumValues>
  <enumValues>
    <name>КоэфУзлования</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентВариацииCd</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентВариацииCk</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентВариацииCp</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентВариацииCt</name>
  </enumValues>
  <enumValues>
    <name>ЛинейнаяПлотность</name>
  </enumValues>
  <enumValues>
    <name>МаксимальнаяСилаРывка03</name>
  </enumValues>
  <enumValues>
    <name>МаксимальнаяСилаРывка177</name>
  </enumValues>
  <enumValues>
    <name>Масса1м</name>
  </enumValues>
  <enumValues>
    <name>МассаОплетки</name>
  </enumValues>
  <enumValues>
    <name>МассаПетли</name>
  </enumValues>
  <enumValues>
    <name>МассаСердечника</name>
  </enumValues>
  <enumValues>
    <name>МассаСтропа</name>
  </enumValues>
  <enumValues>
    <name>НадежностьКрепленияКанатаL1</name>
  </enumValues>
  <enumValues>
    <name>НадежностьКрепленияКанатаL2</name>
  </enumValues>
  <enumValues>
    <name>НомЛинПлотностьНити</name>
  </enumValues>
  <enumValues>
    <name>ОтносительноеУдлинениеПриНагрузке</name>
  </enumValues>
  <enumValues>
    <name>ОтносительноеУдлинениеПриНагрузкеСГС</name>
  </enumValues>
  <enumValues>
    <name>ПодъемнаяПотопляющаяСила</name>
  </enumValues>
  <enumValues>
    <name>РабочаяДлинаСтропа</name>
  </enumValues>
  <enumValues>
    <name>РазрывнаяНагрузка</name>
  </enumValues>
  <enumValues>
    <name>РасходНиткиНаУзел</name>
  </enumValues>
  <enumValues>
    <name>СдвигОплетки</name>
  </enumValues>
  <enumValues>
    <name>УдельнаяРазрывнаяНагрузка</name>
  </enumValues>
  <enumValues>
    <name>Удлинение75</name>
  </enumValues>
  <enumValues>
    <name>УдлинениеПодНагрузкой50150</name>
  </enumValues>
  <enumValues>
    <name>УдлинениеПодНагрузкой80</name>
  </enumValues>
  <enumValues>
    <name>УдлинениеПриРазрыве</name>
  </enumValues>
  <enumValues>
    <name>Усадка</name>
  </enumValues>
  <enumValues>
    <name>УсадкаТехнологическая</name>
  </enumValues>
  <enumValues>
    <name>УстойчивостьВеревкиСУзлом8</name>
  </enumValues>
  <enumValues>
    <name>ФабричныйРазмерЯчеи</name>
  </enumValues>
  <enumValues>
    <name>ФактЛинПлотностьНитиMinMax</name>
  </enumValues>
  <enumValues>
    <name>ФактЛинПлотностьНитиСР</name>
  </enumValues>
  <enumValues>
    <name>ЧислоВитковНа1м</name>
  </enumValues>
  <enumValues>
    <name>МаксимальнаяСилаРывка178</name>
  </enumValues>
</mdclass:Enum>

KanatERPSukhova.КанатАдаптация/src/Enums/КАНАТКач_ВидКачестваДляОтчета/КАНАТКач_ВидКачестваДляОтчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КАНАТКач_ВидКачестваДляОтчета</name>
  <enumValues>
    <name>Сетематериалы</name>
  </enumValues>
  <enumValues>
    <name>ВеревкиСтраховочноСпасательные</name>
  </enumValues>
  <enumValues>
    <name>КанатыДляЛазания</name>
  </enumValues>
  <enumValues>
    <name>ПетлиСтраховочныеТермостойкиеАрамидные</name>
  </enumValues>
  <enumValues>
    <name>СтропыГрузовыеСинтетическиеШнуровыеКольцевые</name>
  </enumValues>
  <enumValues>
    <name>Полуфабрикаты</name>
  </enumValues>
  <enumValues>
    <name>НитиППсЭкструзионнойЛинииSisol</name>
  </enumValues>
  <enumValues>
    <name>ПрочаяГотоваяПродукция</name>
  </enumValues>
</mdclass:Enum>

KanatERPSukhova.КанатАдаптация/src/Documents/КАНАТ_РезультатИспытаний/КАНАТ_РезультатИспытаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КАНАТ_РезультатИспытаний</name>
  <attributes>
    <name>Цех</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Влажность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НТДПродукции</name>
    <type>
      <types>CatalogRef.КАНАТ_НТДНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаПродукции</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказНаПроизводство</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство2_2</types>
      <types>DocumentRef.ПроизводствоБезЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>Структура</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаправочныеПараметры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПартияГотовойПродукции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Температура</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВлажностьФакт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидГотовойПродукцииИспытания</name>
    <type>
      <types>CatalogRef.КАНАТ_ВидыПродукцииКонтрольКачества</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаИМетодикаИспытаний</name>
    <type>
      <types>CatalogRef.КАНАТ_ПрограммаИМетодикаИспытаний</types>
    </type>
  </attributes>
  <attributes>
    <name>Сорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСертификатаКачества</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзготовленияГотовойПродукции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерБухты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>19</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МассаБухты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаБухты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЭтапПроизводства2_2</types>
      <types>DocumentRef.ПроизводствоБезЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодСырье</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСырье</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСырье</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СырьеДляПечатнойФормы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сырье</name>
    <attributes>
      <name>Сырье</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаСырья</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НТДСырья</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ПартияСырья</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПримечаниеПоСырью</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезультатИспытаний</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДПоказатели</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдИзм</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДРазмерности</types>
      </type>
    </attributes>
    <attributes>
      <name>Норма</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопустимоеОтклонение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Факт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыводитьВПФ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/DataProcessors/КАНАТ_ОтчетыРезультатИспытаний/ManagerModule.bsl
Функция ПараметрыСтолбцов(НазваниеОтчета)
	
	Результат = Новый Массив();
	Если НазваниеОтчета = "ОтчетПоИспытаниямГотовойПродукцииОбщий" Тогда
		
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ЛинейнаяПлотность);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.Диаметр);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ЧислоВитковНа1м);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.РазрывнаяНагрузка);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.УдельнаяРазрывнаяНагрузка);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.Удлинение75);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.УдлинениеПриРазрыве);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.КоэффициентВариацииCt);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.КоэффициентВариацииCd);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.КоэффициентВариацииCp);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.КоэффициентВариацииCk);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ПодъемнаяПотопляющаяСила);
		
	ИначеЕсли НазваниеОтчета = "ОтчетПоИспытаниямГотовойПродукцииЦех" Тогда
		
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ЛинейнаяПлотность);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.Диаметр);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ЧислоВитковНа1м);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.РазрывнаяНагрузка);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.УдельнаяРазрывнаяНагрузка);
		
	ИначеЕсли НазваниеОтчета = "ОтчетКанатыДляЛазания" Тогда
		
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.Диаметр);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ДлинаКаната);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.НадежностьКрепленияКанатаL1);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.НадежностьКрепленияКанатаL2);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.РазрывнаяНагрузка);
		
	ИначеЕсли НазваниеОтчета = "ОтчетПетлиСтраховочныеАрамидные" Тогда
		
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.Диаметр);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ВысотаПлетения);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ДлинаПетли);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.МассаПетли);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ОтносительноеУдлинениеПриНагрузке);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.РазрывнаяНагрузка);
		
	ИначеЕсли НазваниеОтчета = "ОтчетСтропы" Тогда
		
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.Диаметр);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ВысотаПлетения);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.РабочаяДлинаСтропа);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.МассаСтропа);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ОтносительноеУдлинениеПриНагрузкеСГС);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.РазрывнаяНагрузка);
		
	ИначеЕсли НазваниеОтчета = "ОтчетПолуфабрикаты" Тогда
		
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ЛинейнаяПлотность);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.Диаметр);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ВиткиНа1м);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.РазрывнаяНагрузка);
		
	ИначеЕсли НазваниеОтчета = "ОтчетНитиSisol" Тогда
		
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.НомЛинПлотностьНити);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ФактЛинПлотностьНитиСР);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ФактЛинПлотностьНитиMinMax);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.РазрывнаяНагрузка);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.УдлинениеПриРазрыве);
		
	ИначеЕсли НазваниеОтчета = "ОтчетПоИспытаниямГотовойПродукцииСДатой" Тогда
		
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ЛинейнаяПлотность);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.Диаметр);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ЧислоВитковНа1м);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.РазрывнаяНагрузка);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.УдельнаяРазрывнаяНагрузка);
		
	ИначеЕсли НазваниеОтчета = "ОтчетНитиSisolСДатами" Тогда
		
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.НомЛинПлотностьНити);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ФактЛинПлотностьНитиСР);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ФактЛинПлотностьНитиMinMax);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.РазрывнаяНагрузка);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.УдлинениеПриРазрыве);
		
	ИначеЕсли НазваниеОтчета = "ОтчетСетематериалы" Тогда
		
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ФабричныйРазмерЯчеи);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.РазрывнаяНагрузка);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.РасходНиткиНаУзел);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.КВПоРазрывнойНагрузке);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.КВПоШагуЯчеи);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.УсадкаТехнологическая);
		
	ИначеЕсли НазваниеОтчета = "ОтчетВеревкиСтраховочноСпасательные" Тогда
		
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.Диаметр);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.Масса1м);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.МассаОплетки);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.МассаСердечника);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.КоэфУзлования);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.СдвигОплетки);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.УдлинениеПодНагрузкой50150);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.УдлинениеПодНагрузкой80);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.МаксимальнаяСилаРывка03);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.МаксимальнаяСилаРывка177);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.КоличествоРывковДоРазрыва1);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.КоличествоРывковДоРазрыва177);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.УстойчивостьВеревкиСУзлом8);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.Усадка);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.РазрывнаяНагрузка);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПараметрыЗапроса(Параметры, НазваниеОтчета)
	
	ПараметрыЗапроса = Новый Структура;
	Если НазваниеОтчета = "ОтчетПоИспытаниямГотовойПродукцииОбщий" Тогда
		
		ВидыДляОтчета = Новый Массив;
		//ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.ВеревкиСтраховочноСпасательные);
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.КанатыДляЛазания);
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.ПетлиСтраховочныеТермостойкиеАрамидные);
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.ПрочаяГотоваяПродукция);
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.СтропыГрузовыеСинтетическиеШнуровыеКольцевые);
		
		ПараметрыЗапроса.Вставить("Период",       Параметры.Период);
		ПараметрыЗапроса.Вставить("ВидДляОтчета", ВидыДляОтчета);
		
	ИначеЕсли НазваниеОтчета = "ОтчетПоИспытаниямГотовойПродукцииЦех" Тогда
		
		ВидыДляОтчета = Новый Массив;
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.ВеревкиСтраховочноСпасательные);
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.КанатыДляЛазания);
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.ПетлиСтраховочныеТермостойкиеАрамидные);
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.ПрочаяГотоваяПродукция);
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.НитиППсЭкструзионнойЛинииSisol);
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.СтропыГрузовыеСинтетическиеШнуровыеКольцевые);
		
		ПараметрыЗапроса.Вставить("Период",       Параметры.Период);
		ПараметрыЗапроса.Вставить("Цех",          Параметры.Цех);
		ПараметрыЗапроса.Вставить("ВидДляОтчета", ВидыДляОтчета);
		
	ИначеЕсли НазваниеОтчета = "ОтчетКанатыДляЛазания" Тогда
		
		ВидыДляОтчета = Новый Массив;
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.КанатыДляЛазания);
		
		ПараметрыЗапроса.Вставить("Период",       Параметры.Период);
		ПараметрыЗапроса.Вставить("ВидДляОтчета", ВидыДляОтчета);
		
	ИначеЕсли НазваниеОтчета = "ОтчетПетлиСтраховочныеАрамидные" Тогда
		
		ВидыДляОтчета = Новый Массив;
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.ПетлиСтраховочныеТермостойкиеАрамидные);
		
		ПараметрыЗапроса.Вставить("Период",       Параметры.Период);
		ПараметрыЗапроса.Вставить("ВидДляОтчета", ВидыДляОтчета);
		
	ИначеЕсли НазваниеОтчета = "ОтчетСтропы" Тогда
		
		ВидыДляОтчета = Новый Массив;
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.СтропыГрузовыеСинтетическиеШнуровыеКольцевые);
		
		ПараметрыЗапроса.Вставить("Период",       Параметры.Период);
		ПараметрыЗапроса.Вставить("ВидДляОтчета", ВидыДляОтчета);
		
	ИначеЕсли НазваниеОтчета = "ОтчетПолуфабрикаты" Тогда
		
		ВидыДляОтчета = Новый Массив;
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.Полуфабрикаты);
		
		ПараметрыЗапроса.Вставить("Период",       Параметры.Период);
		//ПараметрыЗапроса.Вставить("Цех",          Параметры.Цех);
		ПараметрыЗапроса.Вставить("ВидДляОтчета", ВидыДляОтчета);
		
	ИначеЕсли НазваниеОтчета = "ОтчетНитиSisol" Тогда
		
		ВидыДляОтчета = Новый Массив;
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.НитиППсЭкструзионнойЛинииSisol);
		
		ПараметрыЗапроса.Вставить("Период",       Параметры.Период);
		ПараметрыЗапроса.Вставить("Цех",          Параметры.Цех);
		ПараметрыЗапроса.Вставить("ВидДляОтчета", ВидыДляОтчета);
		
	ИначеЕсли НазваниеОтчета = "ОтчетПоИспытаниямГотовойПродукцииСДатой" Тогда
		
		ВидыДляОтчета = Новый Массив;
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.ВеревкиСтраховочноСпасательные);
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.КанатыДляЛазания);
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.ПетлиСтраховочныеТермостойкиеАрамидные);
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.ПрочаяГотоваяПродукция);
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.НитиППсЭкструзионнойЛинииSisol);
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.СтропыГрузовыеСинтетическиеШнуровыеКольцевые);
		
		ПараметрыЗапроса.Вставить("Период",       Параметры.Период);
		ПараметрыЗапроса.Вставить("ВидДляОтчета", ВидыДляОтчета);
		
	ИначеЕсли НазваниеОтчета = "ОтчетНитиSisolСДатами" Тогда
		
		ВидыДляОтчета = Новый Массив;
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.НитиППсЭкструзионнойЛинииSisol);
		
		ПараметрыЗапроса.Вставить("Период",       Параметры.Период);
		ПараметрыЗапроса.Вставить("Цех",          Параметры.Цех);
		ПараметрыЗапроса.Вставить("ВидДляОтчета", ВидыДляОтчета);
		
	ИначеЕсли НазваниеОтчета = "ОтчетСетематериалы" Тогда
		
		ВидыДляОтчета = Новый Массив;
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.Сетематериалы);
		
		ПараметрыЗапроса.Вставить("Период",       Параметры.Период);
		ПараметрыЗапроса.Вставить("ВидДляОтчета", ВидыДляОтчета);
		
	ИначеЕсли НазваниеОтчета = "ОтчетВеревкиСтраховочноСпасательные" Тогда
		
		ВидыДляОтчета = Новый Массив;
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.ВеревкиСтраховочноСпасательные);
		
		ПараметрыЗапроса.Вставить("Период",       Параметры.Период);
		ПараметрыЗапроса.Вставить("ВидДляОтчета", ВидыДляОтчета);
		
	КонецЕсли;
	
	Возврат ПараметрыЗапроса;
	
КонецФункции

Функция ДанныеДляОтчета(Параметры, НазваниеОтчета) Экспорт
	
	ПараметрыЗапроса = ПолучитьПараметрыЗапроса(Параметры, НазваниеОтчета);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	КАНАТ_РезультатИспытаний.Продукция.Код КАК ПродукцияКод,
	               |	КАНАТ_РезультатИспытаний.Цех КАК Цех,
	               |	КАНАТ_РезультатИспытаний.Оборудование КАК Оборудование,
	               |	КАНАТ_РезультатИспытаний.Влажность КАК Влажность,
	               |	КАНАТ_РезультатИспытаний.Результат КАК Результат,
	               |	ВложенныйЗапрос.Факт КАК Факт,
	               |	ВложенныйЗапрос.ПараметрОтчетов КАК ПараметрОтчетов,
	               |	КАНАТ_РезультатИспытаний.Ссылка КАК Ссылка,
	               |	ВложенныйЗапрос.ЕдИзм КАК ЕдИзм,
	               |	НАЧАЛОПЕРИОДА(КАНАТ_РезультатИспытаний.Дата, ДЕНЬ) КАК Дата,
	               |	КАНАТ_РезультатИспытаний.Продукция.НаименованиеПолное КАК ПродукцияНаименование
	               |ИЗ
	               |	Документ.КАНАТ_РезультатИспытаний КАК КАНАТ_РезультатИспытаний
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			КАНАТ_РезультатИспытанийРезультатИспытаний.Ссылка КАК Ссылка,
	               |			КАНАТ_РезультатИспытанийРезультатИспытаний.Факт КАК Факт,
	               |			КАНАТКач_СоответствиеПоказателейНТДКолонкамОтчетов.ПараметрОтчетов КАК ПараметрОтчетов,
	               |			КАНАТ_РезультатИспытанийРезультатИспытаний.ЕдИзм КАК ЕдИзм
	               |		ИЗ
	               |			Документ.КАНАТ_РезультатИспытаний.РезультатИспытаний КАК КАНАТ_РезультатИспытанийРезультатИспытаний
	               |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КАНАТКач_СоответствиеПоказателейНТДКолонкамОтчетов КАК КАНАТКач_СоответствиеПоказателейНТДКолонкамОтчетов
	               |				ПО КАНАТ_РезультатИспытанийРезультатИспытаний.Показатель = КАНАТКач_СоответствиеПоказателейНТДКолонкамОтчетов.Показатель
	               |		ГДЕ
	               |			КАНАТКач_СоответствиеПоказателейНТДКолонкамОтчетов.ПараметрОтчетов В(&МассивПараметров)
	               |			И КАНАТКач_СоответствиеПоказателейНТДКолонкамОтчетов.ВидДляОтчета В(&ВидДляОтчета)) КАК ВложенныйЗапрос
	               |		ПО КАНАТ_РезультатИспытаний.Ссылка = ВложенныйЗапрос.Ссылка
	               |ГДЕ
	               |	КАНАТ_РезультатИспытаний.Проведен = ИСТИНА";
	
	Если ПараметрыЗапроса.Свойство("Период") Тогда
		Запрос.Текст = Запрос.Текст + "
	               |	И КАНАТ_РезультатИспытаний.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
	КонецЕсли; 
	
	Если ПараметрыЗапроса.Свойство("Цех") Тогда
		Запрос.Текст = Запрос.Текст + "
	               |	И КАНАТ_РезультатИспытаний.Цех = &Цех";
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыЗапроса.ВидДляОтчета) = Тип("Массив") Тогда
		Запрос.Текст = Запрос.Текст + "
	               |	И КАНАТ_РезультатИспытаний.ВидГотовойПродукцииИспытания.ВидДляОтчета В (&ВидДляОтчета)";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата
	               |ИТОГИ
	               |	МАКСИМУМ(ПродукцияКод),
	               |	МАКСИМУМ(ПродукцияНаименование),
	               |	МАКСИМУМ(Цех),
	               |	МАКСИМУМ(Оборудование),
	               |	МАКСИМУМ(Влажность),
	               |	МАКСИМУМ(Результат)
	               |ПО  
	               |	Цех,
				   |	Дата,
	               |	Ссылка";
	
	Запрос.УстановитьПараметр("МассивПараметров", ПараметрыСтолбцов(НазваниеОтчета));
	Если ПараметрыЗапроса.Свойство("Период") Тогда
		Запрос.УстановитьПараметр("ДатаНачала", ПараметрыЗапроса.Период.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания", ПараметрыЗапроса.Период.ДатаОкончания);
	КонецЕсли;
	Если ПараметрыЗапроса.Свойство("Цех") Тогда
		Запрос.УстановитьПараметр("Цех", ПараметрыЗапроса.Цех);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВидДляОтчета", ПараметрыЗапроса.ВидДляОтчета);

	
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);;
	
КонецФункции
